export default function Privacy() {
  return (
    <div className="container mx-auto px-4 py-8" dir="rtl">
      <h1 className="text-2xl font-bold mb-4">
        سياسة الخصوصية وإتفاقية الإستخدام
      </h1>
      <p>سياسة الخصوصية وسرية المعلومات</p>
      <p>
        يرحّب بكم فريق عمل (AliiExpress)، ويتقدّم إليكم بالشكر على ثقتكم به،
        ويفيدكم (AliiExpress) بأنه حرصاً منه و لإدراكه التام بأن المستخدم له
        حقوق، فإن (اسم المتجر) يسعى للحفاظ على المعلومات الخاصة بالمستخدمين
        وفقاً لآلية سياسة الخصوصية وسرية المعلومات المعمول بها في (AliiExpress)
        . وعليه فإن (اسم المتجر) يوضّح لكم بأن سياسة الخصوصية وسرية المعلومات
        التي سيتم التعامل مع معلوماتكم الخاصة بكم بموجبها كما يلي:
      </p>
      <p>السياسة.</p>
      <h2 className="text-xl font-semibold mt-4">
        أولاً: المعلومات التي تحصل عليها (AliiExpress) وتحتفظ بها في قواعد
        بياناتها
      </h2>
      <p>
        المعلومات الشخصية الخاصة بالمستخدم، كالإسم والعمر والبريد الالكتروني،
        ورقم الهوية الوطنية أو رقم الإقامة. معلومات الدخول الشخصية الخاصة
        بالمستخدم، مثل اسم المستخدم وكلمة السر والبريد الالكتروني، والسؤال الخاص
        باسترجاع كلمة السر وإجابته. قد تفرض طبيعة المنصة الالكترونية بعض
        المعلومات المتعلّقة بالكوكيز وذلك لأغراض الكترونية تسهّل التعامل بين
        المتجر والمستخدم.
      </p>
      <h2 className="text-xl font-semibold mt-4">
        ثانياً: هل (AliiExpress) تشارك هذه المعلومات؟
      </h2>
      <p>
        بطبيعة الحال فإن (AliiExpress) تسعى بالاحتفاظ بهذه المعلومات بما يحفظ
        خصوصية المستخدم، و(AliiExpress) لا تحتفظ بهذه المعلومات إلا بهدف تحسين
        جودة المتجر الإلكتروني وتيسير التعامل فيما بين (اسم المتجر) والمستخدم.
        كقاعدة عامة فإن جميع هذه المعلومات لا تطلع عليها إلا القائمين على (اسم
        المتجر)، ولن يقوموا بنشرها أو بثها للغير. حيث أن (AliiExpress) تسعى
        للحفاظ على سلامة المستخدمين، فإنه – في حالة ملاحظة (AliiExpress) لأي
        نشاط غير نظامي أو غير شرعي يقوم به المستخدم – فإن (اسم المتجر) قد يقوم
        بإبلاغ الجهات المختصة بعد التشاور مع المحامي الخاص بـ (AliiExpress).
      </p>
      <h2 className="text-xl font-semibold mt-4">
        ثالثاً: ما هو مدى أمان سرية المعلومات الخاصة بالمتجر؟
      </h2>
      <p>
        تسعى (AliiExpress) إلى سرية المعلومات وسياسة الخصوصية الخاصة بالمستخدمين
        و لن تخالف أحكام هذه القواعد والسياسة. ولكن نظراً لعدم إمكانية ضمان ذلك
        100% عبر وسائل الإنترنت فإن فريق عمل (اسم المتجر) ينوّه بما يلي: تسعى
        (AliiExpress) بالحفاظ على جميع المعلومات الخاصة بالمستخدم وألا يطلع
        عليها أحد بما يخالف هذه السياسة المعمول بها في (اسم المتجر). تعمل
        (AliiExpress) على حماية هذه المعلومات عن طريق "سيرفرات معيّنة؟" محمية
        بموجب أنظمة الحماية الإلكترونية "نظامي برمجي أو Software معيّن؟". غير
        أنه نظراً لأن شبكة الانترنت لا يمكن ضمانها 100% لما قد يطرأ من اختراق أو
        فيروسات على أنظمة الحماية الالكترونية و على جدران الحماية المعمول به في
        (AliiExpress) فإن (AliiExpress) تنصح المستخدمين بالحفاظ على معلوماتهم
        بسرية تامة، وعدم إفشاء أي معلومات يراها المستخدم هامة جداً له، وهذا
        حرصاً على (AliiExpress) في توجيه وإرشاد المستخدمين.
      </p>
      <h2 className="text-xl font-semibold mt-4">
        رابعاً: هل هناك طرف ثالث في العلاقة بين (اسم المتجر) والتاجر؟
      </h2>
      <p>
        "تحدد هنا سياسة الخصوصية فيما يتعلّق بالحالات التي يكون هناك طرفاً ثالث،
        كالمسوّقين، والتقنيين، والمستهلك، وأي شخص آخر مرتبط بالعلاقة"
      </p>
      <h2 className="text-xl font-semibold mt-4">
        خامساً: قواعد وأحكام استخدام (AliiExpress):
      </h2>
      <p>
        إن جميع التزامات (AliiExpress)، وجميع التزامات المستخدمين، وجميع الحقوق
        الواردة في العلاقة بين المستخدم أو المستهلك و(AliiExpress)، موجودة هنا
        "يوضع الرابط"، حيث أن هذه القواعد هي "سياسة الخصوصية وسرية المعلومات"
        والمنبثقة من الاتفاقية التي أبرمت بين المستخدم و(AliiExpress) بخصوص
        العلاقة النظامية والقانونية بينهما، وقد وضعت سياسة الخصوصية وسرية
        المعلومات لضمان المصداقية والثقة التي تحرص (AliiExpress) على توفيرها
        للمستخدمين.
      </p>
      <h2 className="text-xl font-semibold mt-4">مقدّمة اتفاقية الاستخدام :</h2>
      <p>
        متجرنا الالكتروني يرحّب بكم ، ( المسجّل برقم "السجل التجاري أو الترخيص
        الرسمي بحسب طبيعة النشاط" ) ، ويبلغكم بأنكم سوف تجدون أدناه الشروط
        والأحكام المُنظّمة لاستخدامكم لهذا المتجر وكافة الآثار القانونية التي
        تنتج عن إستخدامكم لخدمات المتجر عبر الشبكة العنكبوتية عبر هذه المنصة
        الالكترونية، حيث أن استخدام أي شخصٍ كان لـ(AliiExpress) سواءً كان
        مستهلكاً لخدمة أو لمنتج المتجر أو غير ذلك فإن هذا موافقة وقبول منه وهو
        بكامل أهليته المعتبرة شرعاً ونظاماً وقانوناً لكافة مواد وأحكام هذه
        الاتفاقية وهو تأكيد لالتزامكم بأنظمتها ولما ذُكر فيها، وتسري هذه
        الاتفاقية على جميع أنواع التعامل بين المستخدم وبين المتجر فيما عدا
        التعاملات المتعلّقة بالأحوال الشخصية والتعاملات الخاصة بإصدار الصكوك
        المتعلّقة بالتصرفات الواردة على العقار. وتعتبر هذه الاتفاقية سارية
        المفعول ونافذة بمجرد قيامكم بالموافقة عليها والبدء في التسجيل ب(
        AliiExpress ) بموجب المادة العاشرة من نظام التعاملات الإلكترونية
        السعودي.
      </p>
      <h2 className="text-xl font-semibold mt-4">
        المادة الأولى - المقدّمة والتعريفات:
      </h2>
      <p>
        يعتبر التمهيد أعلاه جزءاً لا يتجزأ من هذه الاتفاقية ، كما تجدون أدناه
        الدلالات والتعريفات للعبارات الرئيسية المستخدمة في هذه الاتفاقية :
      </p>
      <ol className="list-decimal list-inside">
        <li>
          ( المتجر ) يقصَد بهذه العبارة ( AliiExpress )، ويشمل هذا التعريف كافة
          أشكال ( AliiExpress ) على الشبكة العنكبوتية، سواءً كانت تطبيق
          إلكتروني، أو موقع الكتروني على الشبكة العنكبوتية، أو محل تجاري.
        </li>
        <li>
          ( المستخدم ) يقصَد بهذه العبارة كل مستهلك يقوم بشراء المنتج أو الخدمة
          من المتجر عبر منصته الالكترونية.
        </li>
        <li>
          ( الاتفاقية ) يقصَد بهذه العبارة شروط وأحكام هذه الاتفاقية، والتي تحكم
          وتنظّم العلاقة فيما بين أطراف هذه الاتفاقية.
        </li>
      </ol>
      <h2 className="text-xl font-semibold mt-4">
        المادة الثانية - أهلية المستخدم القانونية:
      </h2>
      <ol className="list-decimal list-inside">
        <li>
          يقر المستخدم بأنه ذا أهلية قانونية معتبرة شرعاً ونظاماً للتعامل مع
          المتجر، أو أن عمره لا يقل عن ثمانية عشرة عاماً.
        </li>
        <li>
          يوافق المستخدم بأنه في حال مخالفته لهذه المادة، فإنه يتحمّل تبعات هذه
          المخالفة أمام الغير.
        </li>
      </ol>
      <h2 className="text-xl font-semibold mt-4">
        المادة الثالثة - طبيعة التزام ( AliiExpress ):
      </h2>
      <ol className="list-decimal list-inside">
        <li>
          إن التزام ( AliiExpress ) تجاه المستهلكين أو المستخدمين هو توفير (
          الخدمة أو المنتج ) .
        </li>
        <li>
          قد توفّر ( AliiExpress ) خدمات أخرى كخدمات ما بعد البيع أو غيرها من
          الخدمات ذات العلاقة، وذلك يعود لطبيعة ونوع ( الخدمة أو المنتج )
          المطلوبة من المستخدم.
        </li>
      </ol>
    </div>
  );
}
